app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "222"], ["content", "222"], ["created_at", "2021-12-24 07:22:46.088295"], ["updated_at", "2021-12-24 07:22:46.088295"], ["user_id", 3]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    respond_to do |format|
      if @blog.save