app/controllers/favorites_controller.rb

    def create
        favorite = current_user.favorites.create(blog_id: params[:blog_id])
---
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["blog_id", 1], ["created_at", "2021-12-24 07:41:54.894168"], ["updated_at", "2021-12-24 07:41:54.894168"]]